app/views/offices/show.html.erb

SELECT "tools".* FROM "tools" WHERE "tools"."office_id" = ?  [["office_id", 1]]
---
  <tbody>
  <% @office.tools.each do |tool| %>

SELECT "employees".* FROM "employees" WHERE "employees"."office_id" = ?  [["office_id", 1]]
---
  <tbody>
<% @office.employees.each do |employee| %>