app/controllers/employees_controller.rb

SELECT  "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def new
    @employee = Employee.new
    @office = Office.find(params[:office_id])

SELECT  "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "employees" ("name", "birth", "address", "phone", "job", "office_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["birth", ""], ["address", ""], ["phone", ""], ["job", ""], ["office_id", 2], ["created_at", "2018-11-17 15:31:17.148285"], ["updated_at", "2018-11-17 15:31:17.148285"]]
---
  def create
    @office = Office.find(params[:office_id])
    @employee = @office.employees.create(employee_params)

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @employee = Employee.find(params[:office_id])

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @employee = Employee.find(params[:office_id])