app/controllers/offices_controller.rb

SELECT "offices".* FROM "offices"
---
  def index
    @offices = Office.all

INSERT INTO "offices" ("country", "city", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["country", "Hungary"], ["city", "Szeged"], ["address", "kiss utca 30"], ["created_at", "2018-11-11 19:39:51.390148"], ["updated_at", "2018-11-11 19:39:51.390148"]]
---
  def create
    @office = Office.new(office_params)
    if(@office.save)

SELECT  "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @office = Office.find(params[:id])

SELECT  "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @office = Office.find(params[:id])

SELECT  "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "offices" SET "address" = ?, "updated_at" = ? WHERE "offices"."id" = ?  [["address", "kiss utca 55"], ["updated_at", "2018-11-18 13:29:03.644959"], ["id", 1]]
---
  def update
    @office = Office.find(params[:id])
    if(@office.update(office_params))