app/controllers/tools_controller.rb

  def new
    @tool = Tool.new
    @office = Office.find(params[:office_id])
---
SELECT  "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @office = Office.find(params[:office_id])
    @tool = @office.tools.create(tool_params)
---
SELECT  "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tools" ("name", "quantity", "office_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Hurka"], ["quantity", 300], ["office_id", 1], ["created_at", "2018-11-11 20:47:03.894191"], ["updated_at", "2018-11-11 20:47:03.894191"]]

  def show
    @tool = Tool.find(params[:office_id])
---
SELECT  "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @tool = Tool.find(params[:office_id])
---
SELECT  "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]